package org.app.opengl_es_android_version.object;

public class Cube {

    private static final float[] cubeData = {
            // x ,y ,z , R, G, B
            1f, 1f, 1f, 1, 0, 1,   //近平面第一个三角形
            -1f, 1f, 1f, 1, 0, 0,
            -1f, -1f, 1f, 0, 0, 1,

            1f, 1f, 1f, 1, 0, 1, //近平面第二个三角形
            -1f, -1f, 1f, 0, 0, 1,
            1f, -1f, 1f, 0, 1, 0,


            1f, 1f, -1f, 0, 0, 1,   //远平面第一个三角形
            -1f, 1f, -1f, 0, 1, 0,
            -1f, -1f, -1f, 1, 0, 1,
            1f, 1f, -1f, 0, 0, 1,   //远平面第二个三角形
            -1f, -1f, -1f, 1, 0, 1,
            1f, -1f, -1f, 1, 0, 0,


            -1f, 1f, -1f, 0, 1, 0,   //左平面第一个三角形
            -1f, 1f, 1f, 1, 0, 0,
            -1f, -1f, 1f, 0, 0, 1,
            -1f, 1f, -1f, 0, 1, 0,   //左平面第二个三角形
            -1f, -1f, 1f, 0, 0, 1,
            -1f, -1f, -1f, 1, 0, 1,

            1f, 1f, -1f, 0, 0, 1,   //右平面第一个三角形
            1f, 1f, 1f, 1, 0, 1,
            1f, -1f, 1f, 0, 1, 0,
            1f, 1f, -1f, 0, 0, 1,   //右平面第二个三角形
            1f, -1f, 1f, 0, 1, 0,
            1f, -1f, -1f, 1, 0, 0,

            1f, 1f, -1f, 0, 0, 1,   //上平面第一个三角形
            -1f, 1f, -1f, 0, 1, 0,
            -1f, 1f, 1f, 1, 0, 0,
            1f, 1f, -1f, 0, 0, 1,   //上平面第二个三角形
            -1f, 1f, 1f, 1, 0, 0,
            1f, 1f, 1f, 1, 0, 1,

            1f, -1f, -1f, 1, 0, 0,   //下平面第一个三角形
            -1f, -1f, -1f, 1, 0, 1,
            -1f, -1f, 1f, 0, 0, 1,
            1f, -1f, -1f, 1, 0, 0,   //下平面第二个三角形
            -1f, -1f, 1f, 0, 0, 1,
            1f, -1f, 1f, 0, 1, 0,
    };
}
